<script>
definePageMeta({
    layout: false,
})

export default {
    head() {
        return {
            title: 'Политика конфиденциальности | Sora.QL',
            meta: [
                {
                    name: 'description',
                    content: 'Политика конфиденциальности для Sora.QL',
                },
            ],
        };
    },
};
</script>

<template>
    <div>
        <UContainer>
            <div class="py-10">
                <h1 class="text-4xl font-bold mb-2 text-primary">
                    Политика конфиденциальности
                </h1>

                <div class="privacy-policy-content">
                    <p>
                        <strong>Последнее обновление: </strong
                        ><span class="text-primary">2.27.2025</span>
                    </p>

                    <h2 class="text-2xl mt-6">1. Введение</h2>
                    <p>
                        Мы, <strong>Anidzen Ecosystems</strong>, стремимся
                        обеспечить конфиденциальность ваших данных и защиту
                        вашей личной информации. В данной Политике
                        конфиденциальности описывается, как мы собираем,
                        используем, храним и защищаем вашу информацию, когда вы
                        используете наш сервис <strong>Sora.QL</strong>.
                    </p>

                    <h2 class="text-2xl mt-6">
                        2. Информация, которую мы собираем
                    </h2>
                    <p>
                        В процессе использования нашего сервиса мы можем
                        собирать различные виды информации, в том числе:
                    </p>
                    <ul>
                        <li>
                            <strong>Личная информация:</strong> Ваши имя, адрес
                            электронной почты, данные учетной записи, которые вы
                            предоставляете при регистрации или взаимодействии с
                            сервисом.
                        </li>
                        <li>
                            <strong>Данные о использовании сервиса:</strong>
                            Информация о том, как вы используете наш сервис,
                            включая данные о вашем устройстве, браузере,
                            IP-адресе, времени доступа и другие технические
                            данные.
                        </li>
                        <li>
                            <strong>Куки-файлы:</strong> Мы используем куки для
                            улучшения пользовательского опыта. Куки — это
                            небольшие текстовые файлы, которые сохраняются на
                            вашем устройстве.
                        </li>
                    </ul>

                    <h2 class="text-2xl mt-6">
                        3. Как мы используем вашу информацию
                    </h2>
                    <p>Мы используем вашу информацию для следующих целей:</p>
                    <ul>
                        <li>
                            Для предоставления, поддержки и улучшения нашего
                            сервиса;
                        </li>
                        <li>Для персонализации вашего опыта;</li>
                        <li>
                            Для связи с вами по вопросам, связанным с
                            использованием сервиса, уведомлениями или
                            маркетинговыми предложениями, если вы подписались на
                            них;
                        </li>
                        <li>
                            Для анализа использования сервиса с целью улучшения
                            функциональности и пользовательского опыта;
                        </li>
                        <li>
                            Для соблюдения законодательства и предотвращения
                            мошенничества.
                        </li>
                    </ul>

                    <h2 class="text-2xl mt-6">4. Защита ваших данных</h2>
                    <p>
                        Мы принимаем разумные меры для защиты вашей личной
                        информации от несанкционированного доступа,
                        использования или раскрытия. Мы используем стандартные
                        методы безопасности, такие как шифрование данных, для
                        защиты информации.
                    </p>

                    <h2 class="text-2xl mt-6">
                        5. Раскрытие информации третьим лицам
                    </h2>
                    <p>
                        Мы не продаем, не арендуем и не передаем вашу личную
                        информацию третьим лицам, за исключением следующих
                        случаев:
                    </p>
                    <ul>
                        <li>
                            Если это необходимо для выполнения обязательств по
                            нашему договору с вами;
                        </li>
                        <li>
                            Если мы обязаны раскрывать информацию по закону или
                            в ответ на юридические запросы;
                        </li>
                        <li>
                            Если мы передаем информацию в случае слияния,
                            продажи бизнеса или других корпоративных изменений.
                        </li>
                    </ul>

                    <h2 class="text-2xl mt-6">6. Хранение данных</h2>
                    <p>
                        Мы храним вашу информацию столько, сколько это
                        необходимо для выполнения целей, указанных в этой
                        Политике конфиденциальности, или в соответствии с
                        требованиями законодательства.
                    </p>

                    <h2 class="text-2xl mt-6">7. Ваши права</h2>
                    <p>Вы имеете право:</p>
                    <ul>
                        <li>Запрашивать доступ к вашей личной информации;</li>
                        <li>
                            Запрашивать исправление или удаление ваших данных;
                        </li>
                        <li>
                            Отказать в дальнейшем получении маркетинговых
                            уведомлений;
                        </li>
                        <li>
                            Возражать против обработки ваших данных, если это
                            предусмотрено законом.
                        </li>
                    </ul>
                    <p>
                        Для реализации этих прав, пожалуйста, свяжитесь с нами
                        по указанным ниже контактам.
                    </p>

                    <h2 class="text-2xl mt-6">8. Куки-файлы</h2>
                    <p>
                        Наш сервис использует куки для улучшения работы с
                        пользователем. Вы можете настроить свой браузер на отказ
                        от использования куки, однако это может повлиять на
                        функциональность сервиса.
                    </p>

                    <h2 class="text-2xl mt-6">
                        9. Изменения Политики конфиденциальности
                    </h2>
                    <p>
                        Мы можем время от времени обновлять эту Политику
                        конфиденциальности. Все изменения будут опубликованы на
                        этой странице, и они вступают в силу с момента их
                        публикации. Мы рекомендуем вам периодически проверять
                        эту страницу, чтобы быть в курсе последних изменений.
                    </p>

                    <h2 class="text-2xl mt-6">10. Контактная информация</h2>
                    <p>
                        Если у вас есть вопросы по этой Политике
                        конфиденциальности или вы хотите воспользоваться своими
                        правами, пожалуйста, свяжитесь с нами по следующему
                        адресу: <strong>noreply.anidzen@gmail.com</strong>.
                    </p>
                </div>
            </div>
        </UContainer>
    </div>
</template>


<style scoped>
.privacy-policy-content {
    line-height: 1.8;
    font-size: 16px;
}

h2,
h3 {
    color: #333;
}
</style>
