<script>
definePageMeta({
    layout: false,
})

export default {
    head() {
        return {
            title: 'Условия использования | Sora.QL',
            meta: [
                {
                    name: 'description',
                    content: 'Условия использования для Sora.QL',
                },
            ],
        };
    },
};
</script>

<template>
    <div>
        <UContainer>
            <div class="py-10">
                <h1 class="text-4xl font-bold mb-2 text-primary">
                    Условия использования
                </h1>

                <div class="terms-content">
                    <p>
                        <strong>Последнее обновление: </strong
                        ><span class="text-primary">2.27.2025</span>
                    </p>

                    <h2 class="text-2xl mt-6">1. Введение</h2>
                    <p>
                        Добро пожаловать на платформу <strong>Sora.QL</strong>,
                        проект, принадлежащий
                        <strong>Anidzen Ecosystems</strong>. Пожалуйста,
                        внимательно ознакомьтесь с условиями использования
                        данного сервиса перед его использованием. Эти условия
                        регулируют ваше взаимодействие с нашим сервисом, API и
                        контентом.
                    </p>

                    <h2 class="text-2xl mt-6">2. Принятие условий</h2>
                    <p>
                        Используя наш сервис, вы соглашаетесь с настоящими
                        Условиями использования. Если вы не согласны с
                        условиями, вы не имеете права использовать наш сервис.
                        Мы оставляем за собой право в любой момент изменить или
                        обновить эти условия без предварительного уведомления, и
                        изменения вступают в силу немедленно после их публикации
                        на этой странице.
                    </p>

                    <h2 class="text-2xl mt-6">3. Доступ к сервису</h2>
                    <p>
                        Мы предоставляем доступ к нашему сервису на условиях,
                        что вы соблюдаете все применимые законы и нормы. Мы
                        оставляем за собой право приостановить или прекратить
                        доступ к нашему сервису в случае нарушения вами условий
                        использования.
                    </p>

                    <h2 class="text-2xl mt-6">4. Использование контента</h2>
                    <p>
                        Все материалы и данные, доступные через
                        <strong>Sora.QL</strong>, включая текст, изображения,
                        видео, графику и другие элементы контента, являются
                        собственностью <strong>Anidzen Ecosystems</strong> или
                        сторонних владельцев. Вы соглашаетесь не использовать,
                        не копировать, не распространять и не изменять контент
                        без явного разрешения владельцев.
                    </p>

                    <h2 class="text-2xl mt-6">5. Ограничения использования</h2>
                    <p>Вы не можете использовать наш сервис для:</p>
                    <ul>
                        <li>
                            Нарушения авторских прав, патентов или других прав
                            интеллектуальной собственности.
                        </li>
                        <li>Нарушения законов или нормативных актов.</li>
                        <li>Попыток обойти системы безопасности сервиса.</li>
                        <li>
                            Передачи вирусов, шпионского ПО или другого
                            вредоносного кода.
                        </li>
                    </ul>

                    <h2 class="text-2xl mt-6">6. Ответственность</h2>
                    <p>
                        <strong>Sora.QL</strong> предоставляет сервис "как
                        есть". Мы не гарантируем, что сервис будет всегда
                        доступен, бесперебойно работать или будет безошибочно
                        функционировать. Мы не несем ответственности за любые
                        убытки, которые могут возникнуть в результате
                        использования нашего сервиса, включая потерю данных или
                        недоступность сервиса.
                    </p>

                    <h2 class="text-2xl mt-6">7. Прекращение использования</h2>
                    <p>
                        Мы оставляем за собой право в любой момент прекратить
                        ваш доступ к сервису в случае нарушения вами этих
                        Условий использования. Также, если вы решите больше не
                        использовать сервис, вы обязаны прекратить доступ к
                        нашему API и удалить все данные, полученные через него.
                    </p>

                    <h2 class="text-2xl mt-6">8. Изменения условий</h2>
                    <p>
                        Мы оставляем за собой право изменять эти Условия
                        использования в любое время. Все изменения будут
                        опубликованы на этой странице, и они вступают в силу
                        сразу после их публикации. Рекомендуем вам регулярно
                        проверять данную страницу на наличие обновлений.
                    </p>

                    <h2 class="text-2xl mt-6">9. Контактные данные</h2>
                    <p>
                        Если у вас есть вопросы по этим Условиям использования,
                        пожалуйста, свяжитесь с нами по адресу:
                        <strong>noreply.anidzen@gmail.com</strong>.
                    </p>
                </div>
            </div>
        </UContainer>
    </div>
</template>


<style scoped></style>
