<template>
    <div>
        <UContainer>
            <div class="pt-32">
                <h1 class="text-4xl font-bold mb-6 text-primary">
                    Пользовательское соглашение
                </h1>

                <div class="terms-content">
                    <p>
                        <strong>Последнее обновление: </strong
                        ><span class="text-primary">2.27.2025</span>
                    </p>

                    <h2 class="text-2xl mt-6">1. Введение</h2>
                    <p>
                        Добро пожаловать на платформу <strong>Sora.QL</strong>,
                        которая является проектом, принадлежащим
                        <strong>Anidzen Ecosystems</strong>. Используя наши
                        сервисы, вы соглашаетесь с условиями данного
                        пользовательского соглашения. Пожалуйста, внимательно
                        прочитайте его перед использованием нашего сайта или
                        API.
                    </p>

                    <h2 class="text-2xl mt-6">2. Описание сервиса</h2>
                    <p>
                        <strong>Sora.QL</strong> — это сервис, который
                        использует официальный API
                        <strong>MyAnimeList.net</strong> для получения данных о
                        аниме. Однако, важно отметить, что
                        <strong
                            >Sora.QL не является официальным API
                            MyAnimeList.net</strong
                        >. Все данные, получаемые через API, принадлежат
                        <strong>MyAnimeList.net</strong>, и мы не несем
                        ответственности за их точность или полноту.
                    </p>

                    <h2 class="text-2xl mt-6">
                        3. Сбор и использование данных
                    </h2>

                    <h3 class="text-xl mt-4">3.1. Куки</h3>
                    <p>
                        Мы собираем <strong>cookies</strong>, которые необходимы
                        для правильной работы нашего сайта, в том числе для
                        управления настройками темы. Cookies могут содержать
                        информацию о вашем посещении сайта, предпочтениях и
                        других настройках, которые помогают улучшить
                        функциональность нашего сервиса.
                    </p>

                    <h3 class="text-xl mt-4">3.2. API-ключи</h3>
                    <p>
                        Если у вас есть свой аниме-сайт или вы хотите
                        интегрировать данные из нашего API, вы можете запросить
                        API-ключ. API-ключи предоставляются на основе доступных
                        ресурсов и могут быть использованы только в соответствии
                        с этим соглашением. Мы не несём ответственности за
                        использование ваших API-ключей третьими лицами или за
                        нарушение условий использования.
                    </p>

                    <h2 class="text-2xl mt-6">4. Ограничения</h2>
                    <ul>
                        <li>
                            Вы не имеете права использовать данные,
                            предоставляемые через наш сервис, для незаконных
                            целей, включая, но не ограничиваясь,
                            распространением материалов, нарушающих авторские
                            права, или других действий, которые могут привести к
                            ущербу для <strong>MyAnimeList.net</strong> или
                            <strong>Sora.QL</strong>.
                        </li>
                        <li>
                            Мы оставляем за собой право приостановить или
                            ограничить доступ к нашему сервису для
                            пользователей, нарушающих это соглашение.
                        </li>
                    </ul>

                    <h2 class="text-2xl mt-6">5. Ответственность</h2>
                    <p>
                        <strong>Sora.QL</strong> использует данные,
                        предоставляемые официальным API
                        <strong>MyAnimeList.net</strong>, и мы не можем
                        гарантировать их точность или полноту. Мы не несём
                        ответственности за любые ошибки, неточности или перерывы
                        в работе данных, получаемых через API. Наш сервис
                        предоставляет данные «как есть» и не даёт никаких
                        гарантий относительно их точности, полноты или
                        доступности.
                    </p>

                    <h2 class="text-2xl mt-6">6. Изменения в соглашении</h2>
                    <p>
                        Мы оставляем за собой право изменять условия настоящего
                        соглашения в любой момент. Все изменения будут
                        опубликованы на этой странице, и они вступают в силу
                        немедленно после публикации. Рекомендуем регулярно
                        проверять эту страницу на наличие обновлений.
                    </p>

                    <h2 class="text-2xl mt-6">7. Прекращение доступа</h2>
                    <p>
                        Мы оставляем за собой право в любое время ограничить или
                        прекратить доступ к нашему сервису, если вы нарушаете
                        условия этого соглашения или если это необходимо по
                        техническим или юридическим причинам.
                    </p>

                    <h2 class="text-2xl mt-6">8. Контактные данные</h2>
                    <p>
                        Если у вас возникли вопросы или замечания по поводу
                        настоящего соглашения или использования наших сервисов,
                        пожалуйста, свяжитесь с нами по адресу:
                        <strong>noreply.anidzen@gmail.com</strong>.
                    </p>

                    <h2 class="text-2xl mt-6">9. Использование GraphQL API</h2>
                    <p>
                        <strong>Sora.QL</strong> предоставляет доступ к данным
                        через <strong>GraphQL API</strong>. Вы можете
                        использовать это API для получения данных о аниме и
                        интеграции с вашим сервисом. Все запросы к API должны
                        соответствовать условиям этого соглашения.
                    </p>
                    <p>
                        Вы обязуетесь не использовать
                        <strong>GraphQL API</strong> для следующих целей:
                    </p>
                    <ul>
                        <li>
                            Для сбора данных в целях создания конкурирующих
                            сервисов.
                        </li>
                        <li>
                            Для распространения данных, полученных через API, с
                            нарушением авторских прав.
                        </li>
                        <li>
                            Для использования API в целях, которые могут
                            повлиять на производительность или доступность
                            сервиса.
                        </li>
                    </ul>
                    <p>
                        Мы оставляем за собой право ограничить или приостановить
                        доступ к API для пользователей, которые нарушают эти
                        условия.
                    </p>

                    <h2 class="text-2xl mt-6">
                        10. Прерывания обслуживания и изменения в API
                    </h2>
                    <p>
                        Мы оставляем за собой право приостанавливать или
                        изменять доступ к нашему сервису или API по техническим
                        или юридическим причинам. Мы постараемся заблаговременно
                        уведомить пользователей о планируемых перерывах, однако
                        не можем гарантировать отсутствие непредвиденных
                        ситуаций.
                    </p>

                    <h2 class="text-2xl mt-6">11. Авторские права</h2>
                    <p>
                        Все данные, получаемые через наш сервис и API,
                        принадлежат <strong>MyAnimeList.net</strong> и защищены
                        авторскими правами. Вы соглашаетесь не использовать эти
                        данные для любых целей, нарушающих авторские права или
                        нарушающих условия, установленные
                        <strong>MyAnimeList.net</strong>.
                    </p>

                    <h2 class="text-2xl mt-6">12. Обновления соглашения</h2>
                    <p>
                        Мы оставляем за собой право изменять это соглашение в
                        любое время. Обновленные условия будут опубликованы на
                        этой странице, и изменения вступают в силу с момента их
                        публикации. Мы рекомендуем вам периодически проверять
                        эту страницу, чтобы быть в курсе любых изменений.
                    </p>
                </div>
            </div>
        </UContainer>
    </div>
</template>

<script>
export default {
    head() {
        return {
            title: 'Пользовательское соглашение | Sora.QL',
            meta: [
                {
                    name: 'description',
                    content: 'Пользовательское соглашение для Sora.QL',
                },
                {
                    property: 'og:title',
                    content: 'Пользовательское соглашение | Sora.QL',
                },
                {
                    property: 'og:description',
                    content: 'Пользовательское соглашение для Sora.QL',
                },
                { property: 'og:type', content: 'article' },
                {
                    property: 'og:url',
                    content: 'https://soraql.example.com/terms',
                },
            ],
        };
    },
};
</script>

<style scoped></style>
